# Lab | Data Aggregation and Filtering

In this challenge, we will continue to work with customer data from an insurance company. We will use the dataset called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by first performing data cleaning, formatting, and structuring.

1. Create a new DataFrame that only includes customers who have a total_claim_amount greater than $1,000 and have a response of "Yes" to the last marketing campaign.

In [95]:
import pandas as pd
import numpy as np
import seaborn as sns

In [96]:
df = pd.read_csv('marketing_customer_analysis.csv')
pd.options.display.max_columns = None

df.columns = df.columns.str.lower()

df.columns = df.columns.str.replace(' ', '_')

#uniforming the names of the columns

In [97]:
df.head()

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,income,location_code,marital_status,monthly_premium_auto,months_since_last_claim,months_since_policy_inception,number_of_open_complaints,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2/18/11,Employed,M,48029,Suburban,Married,61,7.0,52,0.0,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,NaN
1,1,KX64629,California,2228.525238,No,Basic,College,1/18/11,Unemployed,F,0,Suburban,Single,64,3.0,26,0.0,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,NaN
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2/10/11,Employed,M,22139,Suburban,Single,100,34.0,31,0.0,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,1/11/11,Employed,M,49078,Suburban,Single,97,10.0,3,0.0,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,1/17/11,Medical Leave,F,23675,Suburban,Married,117,NaN,31,NaN,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,NaN

In [98]:
df.dropna(subset = ['customer', 'state', 'response', 'coverage', 'education', 'effective_to_date', 'employmentstatus'], inplace=True),
df.dropna(subset = ['policy_type', 'policy', 'renew_offer_type', 'sales_channel',  'income', 'vehicle_class', 'vehicle_size'], inplace=True),
df.dropna(subset = ['location_code', 'marital_status', 'customer_lifetime_value', 'monthly_premium_auto', 'total_claim_amount'], inplace=True)
df.dropna(subset = ['months_since_last_claim', 'vehicle_type', 'gender', 'months_since_policy_inception', 'number_of_policies'], inplace=True)


df['number_of_open_complaints'].fillna(0, inplace=True)

#Got rid of all NaN values, except on the column of open complaints, in which it's better to have a 0 than to dispose of the whole row

In [100]:
df.isna().sum().sum()

#Checking there is no more NaNs

0

In [101]:
df['total_claim_amount'] = df['total_claim_amount'].astype(int)

In [102]:
df2 = df[(df['total_claim_amount'] > 10000) & (df['response'] == 'Yes')]

#We specify the conditions for the new DF

In [103]:
df2.head()

#Using the method 'head', we see that there is no customer that accomplish those conditions

Empty DataFrame
Columns: [unnamed:_0, customer, state, customer_lifetime_value, response, coverage, education, effective_to_date, employmentstatus, gender, income, location_code, marital_status, monthly_premium_auto, months_since_last_claim, months_since_policy_inception, number_of_open_complaints, number_of_policies, policy_type, policy, renew_offer_type, sales_channel, total_claim_amount, vehicle_class, vehicle_size, vehicle_type]
Index: []

2. Using the original Dataframe, analyze the average total_claim_amount by each policy type and gender for customers who have responded "Yes" to the last marketing campaign. Write your conclusions.

In [108]:
dfyes = df.loc[df['response'] == 'Yes']

#We created a new DF filtering only those rows with 'yes' in the 'response' column

In [114]:
dfyes.groupby(['policy_type', 'gender', 'response'])[['total_claim_amount']].agg('mean')

#Grouping the newly created DF by the specified indications

                                total_claim_amount
policy_type    gender response
Corporate Auto F      Yes               403.636364
               M      Yes               390.852459
Personal Auto  F      Yes               456.586364
               M      Yes               472.071429
Special Auto   F      Yes               495.235294
               M      Yes               368.071429

3. Analyze the total number of customers who have policies in each state, and then filter the results to only include states where there are more than 500 customers.

In [127]:
more500 = df['state'].value_counts()

In [126]:
more500 = more500[more500.values > 500]
print(more500)

state
California    1552
Oregon        1281
Arizona        868
Name: count, dtype: int64

4. Find the maximum, minimum, and median customer lifetime value by education level and gender. Write your conclusions.

In [134]:
df.groupby(['education', 'gender'])[['customer_lifetime_value']].agg('mean')

                             customer_lifetime_value
education            gender
Bachelor             F                   8039.291389
                     M                   8125.264831
College              F                   7798.083814
                     M                   7984.296245
Doctor               F                   8475.302851
                     M                   7659.742101
High School or Below F                   8475.522665
                     M                   7730.151093
Master               F                   8243.128850
                     M                   8013.870033

In [135]:
df.groupby(['education', 'gender'])[['customer_lifetime_value']].agg('max')

                             customer_lifetime_value
education            gender
Bachelor             F                   58753.88046
                     M                   67907.27050
College              F                   61850.18803
                     M                   44795.46942
Doctor               F                   44856.11397
                     M                   32677.34284
High School or Below F                   55277.44589
                     M                   83325.38119
Master               F                   51016.06704
                     M                   50568.25912

In [136]:
df.groupby(['education', 'gender'])[['customer_lifetime_value']].agg('min')

                             customer_lifetime_value
education            gender
Bachelor             F                   1904.000852
                     M                   2030.783687
College              F                   2004.350666
                     M                   1918.119700
Doctor               F                   2395.570000
                     M                   2267.604038
High School or Below F                   2150.178588
                     M                   2132.771675
Master               F                   2417.777032
                     M                   2357.503128

In [ ]:
'''
From the information extracted above, we can see that there is not that much of a difference between the lifetime value between genders or
level of education, but we can see that the means are all closer to their minimum value than to it's maximum value, which means there is a 
positive skew in the lifetime value variable.
'''

## Bonus

5. The marketing team wants to analyze the number of policies sold by state and month. Present the data in a table where the months are arranged as columns and the states are arranged as rows.

6.  Display a new DataFrame that contains the number of policies sold by month, by state, for the top 3 states with the highest number of policies sold.

*Hint:*
- *To accomplish this, you will first need to group the data by state and month, then count the number of policies sold for each group. Afterwards, you will need to sort the data by the count of policies sold in descending order.*
- *Next, you will select the top 3 states with the highest number of policies sold.*
- *Finally, you will create a new DataFrame that contains the number of policies sold by month for each of the top 3 states.*

7. The marketing team wants to analyze the effect of different marketing channels on the customer response rate.

Hint: You can use melt to unpivot the data and create a table that shows the customer response rate (those who responded "Yes") by marketing channel.

External Resources for Data Filtering: https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9

In [ ]:
# your code goes here